HomuraVehicle/homuraLib_v2/machine/device/p32mz2048ecm100_forVC.h
#define _USBLMPR2_LPMFADDR_POSITION              0x00000008
#define _USBLMPR2_LPMFADDR_MASK                  0x00007F00
#define _USBLMPR2_LPMFADDR_LENGTH                0x00000007

#define _CEVER_ID_POSITION                       0x00000000
#define _CEVER_ID_MASK                           0x0000FFFF
#define _CEVER_ID_LENGTH                         0x00000010

#define _CEVER_VERSION_POSITION                  0x00000010
#define _CEVER_VERSION_MASK                      0x00FF0000
#define _CEVER_VERSION_LENGTH                    0x00000008

#define _CEVER_REVISION_POSITION                 0x00000018
#define _CEVER_REVISION_MASK                     0xFF000000
#define _CEVER_REVISION_LENGTH                   0x00000008

#define _CECON_DMAEN_POSITION                    0x00000000
#define _CECON_DMAEN_MASK                        0x00000001
#define _CECON_DMAEN_LENGTH                      0x00000001

#define _CECON_BDPPLEN_POSITION                  0x00000001
#define _CECON_BDPPLEN_MASK                      0x00000002
#define _CECON_BDPPLEN_LENGTH                    0x00000001

#define _CECON_BDPCHST_POSITION                  0x00000002
#define _CECON_BDPCHST_MASK                      0x00000004
#define _CECON_BDPCHST_LENGTH                    0x00000001

#define _CECON_SWAPEN_POSITION                   0x00000005
#define _CECON_SWAPEN_MASK                       0x00000020
#define _CECON_SWAPEN_LENGTH                     0x00000001

#define _CECON_SWRST_POSITION                    0x00000006
#define _CECON_SWRST_MASK                        0x00000040
#define _CECON_SWRST_LENGTH                      0x00000001

#define _CEBDADDR_BDPADDR_POSITION               0x00000000
#define _CEBDADDR_BDPADDR_MASK                   0xFFFFFFFF
#define _CEBDADDR_BDPADDR_LENGTH                 0x00000020

#define _CEBDPADDR_BASEADDR_POSITION             0x00000000
#define _CEBDPADDR_BASEADDR_MASK                 0xFFFFFFFF
#define _CEBDPADDR_BASEADDR_LENGTH               0x00000020

#define _CESTAT_BDCTRL_POSITION                  0x00000000
#define _CESTAT_BDCTRL_MASK                      0x0000FFFF
#define _CESTAT_BDCTRL_LENGTH                    0x00000010

#define _CESTAT_ACTIVE_POSITION                  0x00000010
#define _CESTAT_ACTIVE_MASK                      0x00010000
#define _CESTAT_ACTIVE_LENGTH                    0x00000001

#define _CESTAT_START_POSITION                   0x00000011
#define _CESTAT_START_MASK                       0x00020000
#define _CESTAT_START_LENGTH                     0x00000001

#define _CESTAT_BDSTATE_POSITION                 0x00000012
#define _CESTAT_BDSTATE_MASK                     0x003C0000
#define _CESTAT_BDSTATE_LENGTH                   0x00000004

#define _CESTAT_ERRPHASE_POSITION                0x00000018
#define _CESTAT_ERRPHASE_MASK                    0x03000000
#define _CESTAT_ERRPHASE_LENGTH                  0x00000002

#define _CESTAT_ERROP_POSITION                   0x0000001A
#define _CESTAT_ERROP_MASK                       0x1C000000
#define _CESTAT_ERROP_LENGTH                     0x00000003

#define _CESTAT_ERRMODE_POSITION                 0x0000001D
#define _CESTAT_ERRMODE_MASK                     0xE0000000
#define _CESTAT_ERRMODE_LENGTH                   0x00000003

#define _CEINTSRC_PENDIF_POSITION                0x00000000
#define _CEINTSRC_PENDIF_MASK                    0x00000001
#define _CEINTSRC_PENDIF_LENGTH                  0x00000001

#define _CEINTSRC_CBDIF_POSITION                 0x00000001
#define _CEINTSRC_CBDIF_MASK                     0x00000002
#define _CEINTSRC_CBDIF_LENGTH                   0x00000001

#define _CEINTSRC_PKTIF_POSITION                 0x00000002
#define _CEINTSRC_PKTIF_MASK                     0x00000004
#define _CEINTSRC_PKTIF_LENGTH                   0x00000001

#define _CEINTSRC_AREIF_POSITION                 0x00000003
#define _CEINTSRC_AREIF_MASK                     0x00000008
#define _CEINTSRC_AREIF_LENGTH                   0x00000001

#define _CEINTEN_PENDIE_POSITION                 0x00000000
#define _CEINTEN_PENDIE_MASK                     0x00000001
#define _CEINTEN_PENDIE_LENGTH                   0x00000001

#define _CEINTEN_CBDIE_POSITION                  0x00000001
#define _CEINTEN_CBDIE_MASK                      0x00000002
#define _CEINTEN_CBDIE_LENGTH                    0x00000001

#define _CEINTEN_PKTIE_POSITION                  0x00000002
#define _CEINTEN_PKTIE_MASK                      0x00000004
#define _CEINTEN_PKTIE_LENGTH                    0x00000001

#define _CEINTEN_AREIE_POSITION                  0x00000003
#define _CEINTEN_AREIE_MASK                      0x00000008
#define _CEINTEN_AREIE_LENGTH                    0x00000001

#define _CEPOLLCON_BDPPLCON_POSITION             0x00000000
#define _CEPOLLCON_BDPPLCON_MASK                 0x0000FFFF
#define _CEPOLLCON_BDPPLCON_LENGTH               0x00000010

#define _CEHDLEN_HDRLEN_POSITION                 0x00000000
#define _CEHDLEN_HDRLEN_MASK                     0x000000FF
#define _CEHDLEN_HDRLEN_LENGTH                   0x00000008

#define _CETRLLEN_TRLRLEN_POSITION               0x00000000
#define _CETRLLEN_TRLRLEN_MASK                   0x000000FF
#define _CETRLLEN_TRLRLEN_LENGTH                 0x00000008

#define _RNGVER_REVISION_POSITION                0x00000000
#define _RNGVER_REVISION_MASK                    0x0000007F
#define _RNGVER_REVISION_LENGTH                  0x00000007

#define _RNGVER_VERSION_POSITION                 0x00000007
#define _RNGVER_VERSION_MASK                     0x0000FF80
#define _RNGVER_VERSION_LENGTH                   0x00000009

#define _RNGVER_ID_POSITION                      0x00000010
#define _RNGVER_ID_MASK                          0xFFFF0000
#define _RNGVER_ID_LENGTH                        0x00000010

#define _RNGCON_PLEN_POSITION                    0x00000000
#define _RNGCON_PLEN_MASK                        0x000000FF
#define _RNGCON_PLEN_LENGTH                      0x00000008

#define _RNGCON_TRNGEN_POSITION                  0x00000008
#define _RNGCON_TRNGEN_MASK                      0x00000100
#define _RNGCON_TRNGEN_LENGTH                    0x00000001

#define _RNGCON_PRNGEN_POSITION                  0x00000009
#define _RNGCON_PRNGEN_MASK                      0x00000200
#define _RNGCON_PRNGEN_LENGTH                    0x00000001

#define _RNGCON_CONT_POSITION                    0x0000000A
#define _RNGCON_CONT_MASK                        0x00000400
#define _RNGCON_CONT_LENGTH                      0x00000001

#define _RNGCON_LOAD_POSITION                    0x0000000C
#define _RNGCON_LOAD_MASK                        0x00001000
#define _RNGCON_LOAD_LENGTH                      0x00000001

#define _RNGPOLY1_POLY_POSITION                  0x00000000
#define _RNGPOLY1_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY1_POLY_LENGTH                    0x00000020

#define _RNGPOLY2_POLY_POSITION                  0x00000000
#define _RNGPOLY2_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY2_POLY_LENGTH                    0x00000020

